Repository: 84000/data-translation-memory
Catalog: toh338-v4.tmx
Source language: bo
Languages: en

source: དེ་ཁ་མནམ་པར་འགྱུར་བ་དང་། དེའི་ལུས་ལས་ལྷ་རྣམས་འཕང་བ་དང་། མི་མ་ཡིན་པ་རྣམས་ཀྱིས་དེ་ལ་གླགས་རྙེད་པར་འགྱུར་བ་དང་། བདེན་པ་སྨྲས་ཀྱང་དེ་ལ་སུ་ཡང་ཡིད་ཆེས་པར་མི་འགྱུར་བ་དང་། བརྫུན་སྨྲ་བར་འགྱུར་བ་དང་། ཡིད་ཆེས་པར་བྱ་བའི་གནས་རྣམས་སུ་མཁས་པ་རྣམས་དེ་ལ་དྲི་བར་བྱ་བར་མི་སེམས་པ་དང་། དེའི་བདེན་པ་མ་ཡིན་པ་བསྔགས་པ་དང་། བརྗོད་པ་དང་སྒྲ་དང་། ཚིགས་སུ་བཅད་པ་མ་ཡིན་པ་འབྱུང་བ་དང་། གཟུང་བའི་ཚིག་ཏུ་མི་འགྱུར་བ་དང་། སྐུར་པ་འདེབས་པའི་ལས་བྱེད་ཅིང་སོག་པ་དང་། ལུས་ཞིག་ནས་ཚེ་འཕོས་པའི་འོག་ཏུ་ངན་སོང་ངན་འགྲོ་ལོག་པར་ལྟུང་བ་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་སྐྱེ་བའོ།
en: One will have bad breath; the deities will leave one’s body; nonhuman beings will seek an opportunity to harm; even when one speaks the truth, as a liar one will not be trusted; one will speak even more lies; in matters that one must accept on faith, one will not think it necessary to consult the experts; one will praise, extol, and voice untruth; poetry will be nonexistent; one’s words will not be received sympathetically; one will do and accumulate the action of slandering; and after one has died, one will fall into the lower realms of existence, into evil destinies—one will be reborn in the hell realms. “

source: །འབྲུའི་ཆང་དང་སྦྱར་བའི་ཆང་བག་མེད་པའི་གནས་ལ། ཉེས་དམིགས་སུམ་ཅུ་རྩ་དྲུག་ཏུ་རིག་པར་བྱ་སྟེ།
en: Regarding the loss of mindfulness induced by drinking beer made from fermented barley and other intoxicating liquors, thirty-six evil consequences should be known.

source: སུམ་ཅུ་རྩ་དྲུག་གང་ཞེ་ན།
en: What are the thirty-six?

source: ཚེ་འདི་ལ་ནོར་ཟད་པ་དང་། ནད་ཀྱི་གཞིར་འགྱུར་བ་དང་། འཐབ་པ་དང་། མཚང་འདྲུ་བ་དང་། རྩོད་པ་འཕེལ་བ་དང་། སྦ་བའི་གནས་སྟོན་པ་དང་། མི་སྙན་པ་སྐྱེད་པ་དང་། ཤེས་རབ་ཉམས་པར་བྱེད་པ་དང་། མ་ཐོབ་པའི་ལོངས་སྤྱོད་རྣམས་མི་འཐོབ་པ་དང་། ལོངས་སྤྱོད་ཐོབ་པ་རྣམས་ལས་ཡོངས་སུ་ཉམས་པར་འགྱུར་བ་དང་། གསང་བ་རྣམས་སྨྲ་བ་དང་། ལས་སུ་བྱ་བ་རྣམས་ཡོངས་སུ་ཉམས་པ་དང་། མྱ་ངན་གྱི་རྩ་བར་འགྱུར་བ་དང་། ཉམ་ཆུང་བར་འགྱུར་བ་དང་། མར་མི་འཛིན་པར་འགྱུར་བ་དང་། ཕར་མི་འཛིན་པར་འགྱུར་བ་དང་། དགེ་སྦྱོང་དུ་མི་འཛིན་པར་འགྱུར་བ་དང་། བྲམ་ཟེར་མི་འཛིན་པར་འགྱུར་བ་དང་། རིགས་ཀྱི་གཙོ་བོ་ལ་རིམ་གྲོ་མེད་པར་འགྱུར་བ་དང་། སངས་རྒྱས་ལ་གུས་པར་མི་འགྱུར་བ་དང་། ཆོས་ལ་གུས་པར་མི་འགྱུར་བ་དང་། དགེ་འདུན་ལ་གུས་པར་མི་འགྱུར་བ་དང་། སྡིག་པའི་གྲོགས་པོས་ཡོངས་སུ་ཟིན་པར་འགྱུར་བ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱིས་རྣམ་པར་སྤངས་པ་དང་། ངོ་ཚ་མེད་པར་འགྱུར་བ་དང་། འཛེམ་པ་མེད་པར་འགྱུར་བ་དང་། དབང་པོའི་སྒོ་མ་བསྡམས་པར་འགྱུར་བ་དང་། བུད་མེད་རྣམས་ལ་ཤིན་ཏུ་བག་མེད་པར་འགྱུར་བ་དང་། སྐྱེ་བོ་མང་པོའི་ཡིད་དུ་མི་འོང་བར་འགྱུར་བ་དང་། སྐྱེ་བོ་མང་པོ་དང་མི་འཐུན་པ་དང་ཉེ་དུ་དང་སྣག་གི་གཉེན་མཚམས་བཙུན་པ་རྣམས་ཀྱིས་སྨད་པར་འགྱུར་བ་དང་། དམ་པའི་ཆོས་མ་ཡིན་པ་ཡོངས་སུ་འཛིན་པ་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་སྤོང་བ་དང་། མཁས་པ་རྣམས་དེ་ལ་ཡིད་མི་འཇོག་པར་སེམས་པ་དང་། བག་བྱ་བ་ལ་གཡེལ་བ་དང་དེ་མྱ་ངན་ལས་འདས་པ་ལས་རིང་དུ་འགྱུར་བ་དང་མྱོས་པར་འགྱུར་བའི་ལས་བྱེད་ཅིང་སོག་པ་དང་། ལུས་ཞིག་ནས་ཚེ་འཕོས་པའི་འོག་ཏུ་ངན་སོང་ངན་འགྲོ་ལོག་པར་ལྟུང་བ་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་སྐྱེ་བའོ།
en: In this lifetime one’s wealth will be lost; one will become a ground for disease; quarrels, fights, and conflicts will increase; one will expose oneself; one will disgrace oneself; one’s intelligence will deteriorate; one will not obtain new possessions; one will completely lose the possessions that one has acquired; one will preach secrets in public; one will fail in carrying out one’s duties; one will become a source of suffering for others; one will become weak; one will have disrespect toward one’s mother; one will have disrespect toward one’s father; one will have disrespect toward śramaṇas; one will have disrespect toward brāhmaṇas; one will pay no respect to the head of the family; one will have no reverence toward the Buddha; one will have no reverence toward the Dharma; one will have no reverence toward the Saṅgha; one will be associated with bad friends; one will be completely abandoned by virtuous friends; one will become shameless; one will become immodest; one will become someone who has no self-control; one’s mindfulness with regard to women will fail; one will appear unattractive to many; one will be in disharmony with many people; one will be loathed by one’s paternal and maternal relatives and the noble ones; one will ardently embrace what is not the true Dharma; one ardently abandons the true Dharma; one will not want to pay attention to the experts; one will indolent regarding what one should be careful about; one will be far away from nirvāṇa; one will do and accumulate actions that lead to intoxication; and after one has died, one will fall into the lower realms of existence, into evil destinies—one will be reborn in the hell realms. “

source: །དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་ཐལ་མོ་སྦྱོར་བའི་ཕན་ཡོན་ནི་བཅུ་ཡོད་དེ།
en: There are ten blessings of paying homage at a tathāgata’s stūpa with one’s palms joined in reverence.

source: རྒྱ་ཆེན་པོའི་ཁྱིམ་དུ་སྐྱེ་བ་འཐོབ་པ་དང་རྒྱ་ཆེ་བའི་གཟུགས་དང་རྒྱ་ཆེ་བའི་གཡོག་འཁོར་དང་རྒྱ་ཆེ་བའི་མཆོད་པ་དང་བཀུར་སྟི་དང་ནོར་རྒྱ་ཆེ་བ་དང་ཐོས་པ་རྒྱ་ཆེ་བ་དང་དད་པ་རྒྱ་ཆེ་བ་དང་དྲི་བ་རྒྱ་ཆེ་བ་དང་ཤེས་རབ་རྒྱ་ཆེ་བ་དང་རྟོགས་པ་རྒྱ་ཆེ་བ་འཐོབ་པ་སྟེ། བཅུ་པོ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་ཐལ་མོ་སྦྱར་བའི་ཕན་ཡོན་ནོ།
en: One will obtain birth in a distinguished family, an excellent body, and a large entourage of servants, and one will receive plentiful offerings and veneration; one will obtain extensive wealth, great erudition, great faith, an excellent fragrance, great intelligence, and great wisdom. These are the ten blessings of paying homage at a tathāgata’s stūpa with one’s palms joined in reverence. “

source: །དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་ཕྱག་འཚལ་བའི་ཕན་ཡོན་བཅུ་ཡོད་དེ།
en: There are ten blessings of prostrating to a tathāgata’s stūpa.

source: གཟུགས་བཟང་ཞིང་མདོག་གསེར་གྱི་ཁ་དོག་ལྟ་བུར་འགྱུར་བ་དང་མཛེས་ཤིང་མིག་ཏུ་སྡུག་པར་འགྱུར་བ་དང་། སྐད་སྙན་ཅིང་གཟུང་བའི་ཆིག་ཏུ་འགྱུར་བ་དང་བག་ཚ་བ་མེད་པར་འཁོར་གྱི་ནང་དུ་འགྲོ་བ་དང་ལྷ་དང་མི་རྣམས་དགའ་བར་འགྱུར་བ་དང་གཟི་བྱིན་ཆེན་པོར་འགྱུར་བ་དང་གཟི་བྱིན་ཆེན་པོའི་གང་ཟག་འདི་ལྟ་སྟེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་སངས་རྒྱས་ཀྱི་ཉན་ཐོས་རྣམས་དང་འགྲོགས་པར་འགྱུར་བ་དང་ལོངས་སྤྱོད་ཆེ་བར་འགྱུར་བ་དང་མཐོ་རིས་སུ་སྐྱེ་བར་འགྱུར་བ་དང་མྱུར་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་སྟེ།
en: One’s body will be pleasing and will have a color like that of gold; it will be attractive and lovely to behold; one will have a pleasant voice, and one’s words will be creditable; one will move fearlessly in an assembly; one will be dear to gods and humans; one will be a very charismatic person with considerable prestige; the buddha-bhagavāns, the bodhisattvas, and the Buddha’s hearers will be one’s company; one will have great prosperity; one will be reborn in heaven; and one will quickly attain complete nirvāṇa.

source: བཅུ་པོ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་ཕྱག་འཚལ་བའི་ཕན་ཡོན་ནོ།
en: These are the ten blessings of prostrating at a tathāgata’s stūpa. “

source: །དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་ཕྱག་དར་བྱས་པའི་ཕན་ཡོན་བཅུ་ཡོད་དེ།
en: There are ten blessings of sweeping at a tathāgata’s stūpa.

source: གཟུགས་བཟང་བ་དང་བལྟ་ན་སྡུག་པ་དང་མཛེས་པ་དང་སྐད་སྙན་པ་དང་དེའི་འདོད་ཆགས་དང་ཞེ་སྡང་དང་། གཏི་མུག་བསྲབས་པར་འགྱུར་བ་དང་ལམ་དུ་འགྲོ་ན་རྩྭ་དང་གྱོ་མོ་དང་གསེག་མ་རྣམས་མེད་པར་འགྱུར་བ་དང་བཙུན་པའི་རིགས་སུ་སྐྱེ་བར་འགྱུར་བ་དང་ལོངས་སྤྱོད་ཆེ་བར་འགྱུར་བ་དང་མཐོ་རིས་སུ་སྐྱེ་བར་འགྱུར་བ་དང་མྱུར་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་སྟེ།
en: One’s body will be pleasing, a pleasure to look at, and beautiful, and one will have a pleasant voice; one’s attachment, hatred, and ignorance will diminish; when one walks on a path, there will be no grass, gravel, or pebbles; one will be born into a noble family; one will have great prosperity; one will be reborn in heaven; and one will quickly attain complete nirvāṇa.

source: བཅུ་པོ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་ཕྱག་དར་བྱས་པའི་ཕན་ཡོན་ནོ།
en: These are the ten blessings of sweeping at a tathāgata’s stūpa. “

source: །དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་གདུགས་དབུལ་བའི་ཕན་ཡོན་བཅུ་ཡོད་དེ།
en: There are ten blessings of offering a parasol at a tathāgata’s stūpa.

source: འཇིག་རྟེན་ན་གདུགས་ལྟ་བུར་འགྱུར་བ་དང་ལུས་ལ་ཚ་བས་གདུང་བ་མེད་པར་འགྱུར་བ་དང་སེམས་ལ་གདུང་བ་མེད་པར་འགྱུར་བ་དང་འཇིག་རྟེན་གྱི་རྟེན་དུ་འགྱུར་བ་དང་བདག་པོར་འགྱུར་བའི་ལས་བྱེད་ཅིང་སོག་པ་དང་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་ཡང་དག་པར་འཐོབ་པ་དང་དབང་ཆེ་བར་གྲགས་པར་འགྱུར་བ་དང་། ལོངས་སྤྱོད་ཆེ་བར་འགྱུར་བ་དང་། མཐོ་རིས་སུ་སྐྱེ་བར་འགྱུར་བ་དང་། མྱུར་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་སྟེ།
en: One will be like a parasol in the world; one’s body will never be scorched by heat; one’s mind, too, will not be distressed; one will become a support for the world; one will do and accumulate actions that lead to becoming a sovereign; one will obtain the empire of a wheel-turning monarch; one will become a powerful notability; one will have great prosperity; one will be reborn in heaven; and one will quickly attain complete nirvāṇa.

source: བཅུ་པོ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་གདུགས་ཕུལ་བའི་ཕན་ཡོན་ནོ།
en: These are the ten blessings of offering a parasol at a tathāgata’s stūpa. “

source: །དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་དྲིལ་བུ་དབུལ་བའི་ཕན་ཡོན་བཅུ་ཡོད་དེ།
en: There are ten blessings of offering a bell at a tathāgata’s stūpa.

source: གཟུགས་བཟང་བར་འགྱུར་བ་དང་སྐད་སྙན་པར་འགྱུར་བ་དང་ཡིད་དུ་འོང་བ་སྨྲ་བ་དང་ལྡན་པར་འགྱུར་བ་དང་ཀ་ལ་པིང་ཀའི་སྒྲ་ལྟ་བུ་སྨྲ་བ་དང་ལྡན་པར་འགྱུར་བ་དང་གཟུང་བའི་ཚིག་ཏུ་འགྱུར་བ་དང་རབ་ཏུ་དགའ་བར་འགྱུར་བ་དང་། ཀུན་ཏུ་དགའ་བ་རྒྱ་ཆེན་པོའི་སྒྲ་འཐོབ་པ་དང་ལོངས་སྤྱོད་ཆེ་བར་འགྱུར་བ་དང་མཐོ་རིས་སུ་སྐྱེ་བར་འགྱུར་བ་དང་མྱུར་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་སྟེ།
en: One’s body will be pleasing; one will have a pleasant voice; one will speak charmingly; one’s speech will become like the voice of the kalaviṅka bird; one’s words will be received sympathetically; one will become exceedingly happy; one will hear delightful, sublime sounds; one will have great prosperity; one will be reborn in heaven; one will quickly attain complete nirvāṇa.

source: བཅུ་པོ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་དྲིལ་བུ་ཕུལ་བའི་ཕན་ཡོན་ནོ།
en: These are the ten blessings of offering a bell at a tathāgata’s stūpa. “

source: །དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་བ་དན་དབུལ་བའི་ཕན་ཡོན་བཅུ་ཡོད་དེ།
en: There are ten blessings of offering a flag at a tathāgata’s stūpa.

source: འཇིག་རྟེན་ན་རྒྱལ་མཚན་ལྟ་བུར་འགྱུར་བ་དང་མཛའ་བཤེས་དང་བློན་པོ་དང་ཉེ་དུ་དང་སྣག་གི་གཉེན་མཚམས་རྣམས་བསྟི་སྟང་བྱེད་བླ་མར་བྱེད་རི་མོར་བྱེད་མཆོད་པར་བྱེད་པ་དང་། ཕྱོགས་དང་ཕྱོགས་མཚམས་རྣམས་སུ་དེའི་གྲགས་པ་དང་བརྗོད་པ་དང་སྒྲ་དང་ཚིགས་སུ་བཅད་པ་མངོན་དུ་འབྱུང་བ་དང་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པར་འགྱུར་བ་དང་སྐྱེ་བ་གཞན་རྣམས་སུ་ཚེ་རིང་ཞིང་རིང་དུ་གནས་པར་འགྱུར་བ་དང་། དབང་ཆེ་བར་གྲགས་པར་འགྱུར་བ་དང་རིགས་བཙུན་པར་སྐྱེ་བར་འགྱུར་བ་དང་ལོངས་སྤྱོད་ཆེན་པོར་འགྱུར་བ་དང་མཐོ་རིས་སུ་སྐྱེ་བར་འགྱུར་བ་དང་མྱུར་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་བ་སྟེ།
en: One will be like a victory banner in the world; one’s close friends, family members, paternal relatives, and maternal relatives will show one respect, and one will be revered, venerated, and worshiped by them; one’s glory, praise, renown, and good reputation will manifest in all directions; one will have a pleasing body and will be a pleasure to look at and beautiful; in one’s future lives one will have a long lifespan, and one will stay long; one will become a powerful notability; one will be born into a noble family; one will have great prosperity; one will be reborn in heaven; and one will quickly attain complete nirvāṇa.

source: བཅུ་པོ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་བ་དན་ཕུལ་བའི་ཕན་ཡོན་ནོ།
en: These are the ten blessings of offering a flag at tathāgata’s stūpa. “

source: །དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་ན་བཟའ་དབུལ་བའི་ཕན་ཡོན་བཅུ་གཉིས་ཡོད་དེ།
en: There are twelve blessings of offering garments at a tathāgata’s stūpa.

source: བཅུ་གཉིས་གང་ཞེ་ན། མཛེས་ཤིང་བལྟ་ན་སྡུག་པར་འགྱུར་བ་དང་། པགས་པ་འཇམ་པ་དང་། པགས་པ་སྣུམ་པ་དང་། པགས་པ་སྲབ་པ་དང་།
en: What are the twelve?

source: དེའི་ལུས་ལ་རྡུལ་དང་དྲི་མ་མི་འཆགས་པ་དང་དེའི་གོས་བཟང་པོར་འགྱུར་བ་དང་། གདིང་བ་དང་། བགོ་བ་ཕྲ་མོ་རྙེད་པར་འགྱུར་བ་དང་། ངོ་ཚ་ཤེས་པ་དང་། ཁྲེལ་ཡོད་པ་ཕུན་སུམ་ཚོགས་པར་འགྱུར་བ་དང་། མཐོང་ན་དགའ་བར་འགྱུར་བ་དང་། ལོངས་སྤྱོད་ཆེ་བར་འགྱུར་བ་དང་། མཐོ་རིས་སུ་སྐྱེ་བར་འགྱུར་བ་དང་།
en: One will be beautiful and lovely to behold; one will have skin that is soft, silken, and fine; dust and dirt will be unable to stick to one’s body; one will possess fine carpets; one will possess fine clothes; one will have a conscience; one will be endowed with decorum; one will be delightful to look at; one will have great prosperity; one will be reborn in heaven; and one will quickly attain complete nirvāṇa.

source: ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་སྟེ། བཅུ་གཉིས་པོ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་ན་བཟའ་ཕུལ་བའི་ཕན་ཡོན་ནོ།
en: These are the twelve blessings of offering garments at a tathāgata’s stūpa. “

source: །དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་མེ་ཏོག་དབུལ་བའི་ཕན་ཡོན་བཅུ་ཡོད་དེ།
en: There are ten blessings of offering a flower at a tathāgata’s stūpa.

source: འཇིག་རྟེན་ན་མེ་ཏོག་ལྟ་བུར་འགྱུར་བ་དང་། དེའི་སྣའི་དབང་པོ་ནམ་ཡང་ཉམས་པར་མི་འགྱུར་བ་དང་། ལུས་ལ་དྲི་ང་བ་མེད་པར་འགྱུར་བ་དང་། ལུས་ལ་དྲི་ཞིམ་པོ་འབྱུང་བར་འགྱུར་བ་དང་། ཕྱོགས་དང་ཕྱོགས་མཚམས་རྣམས་སུ་དེའི་ཚུལ་ཁྲིམས་ཀྱི་དྲིའི་ངད་ལྡང་བར་འགྱུར་བ་དང་། འཇིག་རྟེན་པ་རྣམས་འཁོར་ཞིང་འདུ་བར་འགྱུར་བ་དང་། ཡིད་དུ་འོང་བའི་ཆོས་རྣམས་འཐོབ་པར་འགྱུར་བ་དང་། ལོངས་སྤྱོད་ཆེ་བར་འགྱུར་བ་དང་། མཐོ་རིས་སུ་སྐྱེ་བར་འགྱུར་བ་དང་། མྱུར་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་སྟེ།
en: One will become like a flower in the world; one’s sense of smell will never deteriorate; one’s body will never smell bad; one’s body will exude fragrance; the fine fragrance of moral discipline will pervade the cardinal and intermediate directions; worldly deities will gather and surround one; one will obtain all attractive qualities; one will have great prosperity; one will be reborn in heaven; and one will quickly attain complete nirvāṇa.

source: ཆོས་བཅུ་པོ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་མེ་ཏོག་ཕུལ་བའི་ཕན་ཡོན་ནོ།
en: These are the ten blessings of offering a flower at a tathāgata’s stūpa. “

source: །དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་ཕྲེང་བ་དབུལ་བའི་ཕན་ཡོན་བཅུ་ཡོད་དེ།
en: There are ten blessings of offering a garland at a tathāgata’s stūpa.

source: འཇིག་རྟེན་ན་ཕྲེང་བ་ལྟ་བུར་འགྱུར་བ་དང་། ལུས་ཀྱི་དྲི་ང་བ་མེད་པར་འགྱུར་བ་དང་། ཕྱོགས་དང་ཕྱོགས་མཚམས་རྣམས་སུ་ཚུལ་ཁྲིམས་ཀྱི་དྲི་ཞིམ་པོའི་ངད་ལྡང་བ་དང་། རྟག་ཏུ་དྲི་ཞིམ་པར་འགྱུར་བ་དང་། བརྒྱན་པར་འགྱུར་བ་དང་། གཡོག་འཁོར་མི་ཕྱེད་པར་འགྱུར་བ་དང་། སྐྱེས་པ་དང་བུད་མེད་རྣམས་ཀྱི་ཡིད་དུ་འོང་བར་འགྱུར་བ་དང་། ལོངས་སྤྱོད་ཆེ་བར་འགྱུར་བ་དང་། མཐོ་རིས་སུ་སྐྱེ་བར་འགྱུར་བ་དང་། མྱུར་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་སྟེ།
en: One will become garland-like in the world; one’s body will never smell bad; the fine fragrance of moral discipline will pervade the cardinal and intermediate directions; one will always be fragrant; one will always be adorned; one’s entourage will be undivided; one will be appealing to women; one will enjoy vast resources; one will be reborn in heaven; and one will quickly attain complete nirvāṇa.

source: བཅུ་པོ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་ཕྲེང་བ་ཕུལ་བའི་ཕན་ཡོན་ནོ།
en: These are the ten blessings of offering a garland at a tathāgata’s stūpa. “

source: །དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་མར་མེ་དབུལ་བའི་ཕན་ཡོན་བཅུ་ཡོད་དེ།
en: There are ten blessings of offering a light at a tathāgata’s stūpa.

source: འཇིག་རྟེན་ན་མར་མེ་ལྟ་བུར་འགྱུར་བ་དང་། ཤའི་མིག་རྣམ་པར་དག་པར་འགྱུར་བ་དང་། ལྷའི་མིག་འཐོབ་པར་འགྱུར་བ་དང་། དགེ་བ་དང་མི་དགེ་བའི་ཆོས་རྣམས་ལ་ཤེས་རབ་འབྱུང་བར་འགྱུར་བ་དང་། མ་རིག་པ་དང་གཏི་མུག་གི་མུན་པ་སེལ་བ་དང་། ཤེས་རབ་ཀྱི་སྣང་བ་འཐོབ་པར་འགྱུར་བ་དང་། དེ་འཁོར་བ་ན་འཁོར་བའི་ཚེ་ནམ་ཡང་མུན་པ་ན་གནས་པར་མི་འགྱུར་བ་དང་། ལོངས་སྤྱོད་ཆེ་བར་འགྱུར་བ་དང་། མཐོ་རིས་སུ་སྐྱེ་བར་འགྱུར་བ་དང་།
en: One will become like a lamp in the world; one’s physical eyes will be completely purified; one will become clairvoyant; the wisdom to discriminate virtuous and nonvirtuous qualities will emerge; ignorance and the darkness of mental obscuration will be cleared away; the light of wisdom will dawn; even while wandering in saṃsāra, one will not be in darkness; one will have great prosperity; one will be reborn in heaven; and one will quickly attain complete nirvāṇa.

source: མྱུར་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་སྟེ། བཅུ་པོ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་མར་མེ་ཕུལ་བའི་ཕན་ཡོན་ནོ།
en: These are the ten blessings of offering a lamp at a tathāgata’s stūpa. “

source: །དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་བྱུག་སྤོས་དབུལ་བའི་ཕན་ཡོན་བཅུ་ཡོད་དེ།
en: There are ten blessings of offering scented water at a tathāgata’s stūpa.

source: འཇིག་རྟེན་ན་བྱུག་སྤོས་ལྟ་བུར་འགྱུར་བ་དང་། སྣའི་དབང་པོ་རྣམ་པར་དག་པར་འགྱུར་བ་དང་། ལུས་ལ་དྲི་མི་ཞིམ་པ་མེད་པར་འགྱུར་བ་དང་། རྟག་ཏུ་དྲི་ཞིམ་པར་འགྱུར་བ་དང་། གཟུགས་བཟང་བར་འགྱུར་བ་དང་། འཇིག་རྟེན་པ་རྣམས་འཁོར་ཞིང་འདུ་བར་འགྱུར་བ་དང་། ཡིད་དུ་འོང་བའི་ཆོས་རྣམས་ཐོས་པར་འགྱུར་བ་དང་། ལོངས་སྤྱོད་ཆེན་པོར་འགྱུར་བ་དང་། མཐོ་རིས་སུ་སྐྱེ་བར་འགྱུར་བ་དང་། མྱུར་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་སྟེ།
en: One will become perfume-like in the world; one’s sense of smell will be completely purified; one’s body will never smell bad; one will always be fragrant; one’s body will be pleasing; worldly deities will gather and surround one; one will obtain all attractive qualities; one will have great prosperity; one will be reborn in heaven; and one will quickly attain complete nirvāṇa.

source: ཆོས་བཅུ་པོ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་བྱུག་སྤོས་ཕུལ་བའི་ཕན་ཡོན་ནོ།
en: These are the ten blessings of offering scented water at a tathāgata’s stūpa. “

source: །དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་རོལ་མོ་དང་སིལ་སྙན་དབུལ་བའི་ཕན་ཡོན་བཅུ་ཡོད་དེ།
en: There are ten blessings of offering music and cymbals at a tathāgata’s stūpa.

source: གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་པར་འགྱུར་བ་དང་། སྐད་སྙན་པར་འགྱུར་བ་དང་། ཡིད་དུ་འོང་བ་སྨྲ་བ་དང་ལྡན་པར་འགྱུར་བ་དང་། གྲགས་པ་དང་ལྡན་པར་འགྱུར་བ་དང་། གཟུང་བའི་ཚིག་ཏུ་འགྱུར་བ་དང་། རྟག་ཏུ་དགའ་བར་འགྱུར་བ་དང་། ཐམས་ཅད་དགའ་བའི་སྒྲ་རྒྱ་ཆེན་པོ་འཐོབ་པར་འགྱུར་བ་དང་། ལོངས་སྤྱོད་ཆེ་བར་འགྱུར་བ་དང་། མཐོ་རིས་སུ་སྐྱེ་བར་འགྱུར་བ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་བ་སྟེ།
en: One’s body will be pleasing and lovely to behold; one will have a pleasant voice; one’s speech will be charming; one will be famous; one’s words will be creditable; one will always be joyful; one will obtain an exalted voice that pleases all; one will have great prosperity; one will be reborn in heaven; and one will quickly attain complete nirvāṇa.

source: བཅུ་པོ་དེ་དག་ནི། དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་རོལ་མོ་སིལ་སྙན་ཕུལ་བའི་ཕན་ཡོན་ནོ།
en: These are the ten blessings of offering music and cymbals at a tathāgata’s stūpa. “

source: །དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་བྱེད་པའི་ཕན་ཡོན་བཅོ་བརྒྱད་ཡོད་དེ།
en: There are eighteen blessings of erecting a tathāgata stūpa.

source: བཅོ་བརྒྱད་གང་ཞེ་ན།
en: What are the eighteen?

source: རྒྱ་ཆེན་པོའི་རིགས་སུ་སྐྱེ་བར་འགྱུར་བ་དང་། གཟུགས་བཟང་བར་འགྱུར་བ་དང་། མཛེས་ཤིང་མིག་ཏུ་སྡུག་པར་འགྱུར་བ་དང་། དབང་ཆེ་བར་གྲགས་པར་འགྱུར་བ་དང་། གཡོག་འཁོར་རྒྱ་ཆེན་པོར་འགྱུར་བ་དང་། གཡོག་འཁོར་མི་ཕྱེད་པར་འགྱུར་བ་དང་། ལོངས་སྤྱོད་ཆེ་བར་འགྱུར་བ་དང་། འཇིག་རྟེན་པ་རྣམས་འཁོར་ཞིང་འདུ་བར་འགྱུར་བ་དང་། ཀུན་གྱི་རྟེན་དུ་འགྱུར་བ་དང་། ཕྱོགས་བཅུར་བརྗོད་པ་དང་། སྒྲ་དང་ཚིགས་སུ་བཅད་པ་རྒྱ་ཆེན་པོ་མངོན་དུ་འབྱུང་བར་འགྱུར་བ་དང་། ལྷ་དང་མིས་མཆོད་པར་འགྱུར་བ་དང་། ཕྱུག་ཅིང་ནོར་མང་པོ་དང་ལྡན་པར་འགྱུར་བ་དང་། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་འཐོབ་པར་འགྱུར་བ་དང་། ཚེ་རིང་བར་འགྱུར་བ་དང་། ལུས་རྡོ་རྗེ་ལྟར་མཁྲེགས་པར་འགྱུར་བ་དང་། ལུས་མཚན་དང་དཔེ་བྱད་དང་ལྡན་པར་འགྱུར་བ་དང་། མཐོ་རིས་སུ་སྐྱེ་བར་འགྱུར་བ་དང་། མྱུར་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་སྟེ།
en: One will be born in a noble family; one’s body will be pleasing; it will be beautiful and a feast for the eyes; one will become a powerful notability; one will have a very large retinue; one’s entourage will be undivided; one will have great prosperity; worldly deities will gather and surround one; one will become a support for all; one’s glory, renown, and good reputation will spread throughout the ten directions; one will be celebrated by gods and humans; one will possess great riches and wealth; one will obtain the empire of a wheel-turning monarch; one’s lifespan will be long; one will have an adamantine body; one will be endowed with the major and minor physical marks; one will be reborn in heaven; and one will quickly attain complete nirvāṇa.

source: བཅོ་བརྒྱད་པོ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་བྱེད་པའི་ཕན་ཡོན་ནོ།
en: These are the eighteen blessings of erecting a tathāgata stūpa. “

source: །ཁྲི་སྟན་བྱིན་པའི་ཕན་ཡོན་བཅུ་ཡོད་དེ། བཅུ་གང་ཞེ་ན།
en: What are the ten blessings of offering a cushioned seat?

source: འཇིག་རྟེན་གྱི་བླ་མའི་གནས་སུ་འགྱུར་བ་དང་། བསྔགས་པར་འགྱུར་བ་དང་། སྐྱེ་བོ་མང་པོ་ལ་གྲགས་པ་དང་། བརྗོད་པ་དང་། སྒྲ་དང་ཚིགས་སུ་བཅད་པ་མང་པོ་མངོན་དུ་འབྱུང་བར་འགྱུར་བ་དང་། བདེ་བ་དང་། ཡིད་བདེ་བ་མང་བར་འགྱུར་བ་དང་། བཞོན་པ་དང་། ཁྲི་སྟན་དང་། རིམ་གྲོ་བྱེད་པ་དང་ལྡན་པར་འགྱུར་བ་དང་། འཇིག་རྟེན་པ་རྣམས་འཁོར་ཞིང་འདུ་བར་འགྱུར་བ་དང་། ལོངས་སྤྱོད་ཆེ་བར་འགྱུར་བ་དང་། དབང་ཆེ་བར་གྲགས་པར་འགྱུར་བ་དང་། མཐོ་རིས་སུ་སྐྱེ་བར་འགྱུར་བ་དང་། མྱུར་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་སྟེ།
en: One will enter a high rank in the world; one will become praiseworthy; one’s glory, praise, renown, and good reputation will spread far and wide; one will have much happiness and satisfaction of mind; one will be furnished with a carriage, a cushioned seat, and servants; worldly deities will gather and surround one; one will have great prosperity; one will become a powerful notability; one will be reborn in heaven; and one will quickly attain complete nirvāṇa.

source: བཅུ་པོ་དེ་དག་ནི་ཁྲི་སྟན་བྱིན་པའི་ཕན་ཡོན་ནོ།
en: These are the ten blessings of offering a cushioned seat. “

source: །ལྷམ་བྱིན་པའི་ཕན་ཡོན་བཅུ་ཡོད་དེ། བཅུ་གང་ཞེ་ན།
en: What are the ten blessings of offering shoes?

source: དེ་བཞོན་པ་རྣམས་ཀྱིས་བྲེལ་བར་མི་འགྱུར་བ་དང་། རྐང་པ་ལེགས་པར་གནས་པར་འགྱུར་བ་དང་། ལམ་དུ་འགྲོ་ན་སྟོབས་དང་ལྡན་པར་འགྱུར་བ་དང་། དེའི་ལུས་ངལ་བར་མི་འགྱུར་བ་དང་། དེ་འགྲོ་ན་ཚེར་མ་དང་གསེག་མ་དང་གྱོ་མོ་རྣམས་ཀྱིས་རྐང་པ་སྣད་པར་མི་འགྱུར་བ་དང་། རྫུ་འཕྲུལ་ཐོབ་པར་འགྱུར་བ་དང་། དེ་ལ་རིམ་གྲོ་བྱེད་པ་དང་ལྡན་པར་འགྱུར་བ་དང་། ལོངས་སྤྱོད་ཆེ་བར་འགྱུར་བ་དང་། མྱུར་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་སྟེ།
en: One will never lack a carriage; one’s legs will be well formed; one will persevere when traveling on a road; one’s body will not get tired; when walking, one’s feet will not be injured by thorns, gravel, or rocks; one will obtain magical powers; one will have servants; one will have great prosperity; one will be reborn in heaven; and one will quickly attain complete nirvāṇa.

source: བཅུ་པོ་དེ་དག་ནི་ལྷམ་བྱིན་པའི་ཕན་ཡོན་ནོ།
en: These are the ten blessings of offering shoes. “

source: །སྣོད་སྤྱད་བྱིན་པའི་ཕན་ཡོན་བཅུ་ཡོད་དེ། བཅུ་གང་ཞེ་ན།
en: What are the ten blessings of offering a bowl?

source: འཇིག་རྟེན་གྱི་ཡོན་ཏན་གྱི་སྣོད་ལྟ་བུར་འགྱུར་བ་དང་། མདོག་སྣུམ་པར་འགྱུར་བ་དང་། སེམས་ཀྱི་རྒྱུད་མཉེན་པར་འགྱུར་བ་དང་། སྐོམ་པར་མི་འགྱུར་བ་དང་། སྐོམ་ན་ཡང་ཆུ་འབྱུང་བར་འགྱུར་བ་དང་། ཡི་དགས་སུ་སྐྱེ་བར་མི་འགྱུར་བ་དང་། ལྷ་དང་མི་རྣམས་དགའ་བར་འགྱུར་བ་དང་། ལོངས་སྤྱོད་ཆེ་བར་འགྱུར་བ་དང་། མཐོ་རིས་སུ་སྐྱེ་བར་འགྱུར་བ་དང་། མྱུར་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་སྟེ།
en: One will become like a container for all good qualities of the world; one’s complexion will be radiant; one’s mindstream will be supple; one will not suffer thirst; if thirsty, water will appear; one will not be reborn among the ghosts; one will be dear to gods and humans; one will have great prosperity; one will be reborn in heaven; and one will quickly attain complete nirvāṇa.

source: བཅུ་པོ་དེ་དག་ནི་སྣོད་སྤྱད་བྱིན་པའི་ཕན་ཡོན་ནོ།
en: These are the ten blessings of offering a bowl. “

source: །ཁ་ཟས་སྦྱིན་པའི་ཕན་ཡོན་བཅུ་ཡོད་དེ། བཅུ་གང་ཞེ་ན།
en: What are the ten blessings of offering food?

source: ཚེ་རིང་བར་འགྱུར་བ་དང་། མདོག་བཟང་བར་འགྱུར་བ་དང་། སྟོབས་དང་ལྡན་པར་འགྱུར་བ་དང་། དྲན་པ་དང་ལྡན་ཞིང་སྤོབས་པ་དང་ལྡན་པར་འགྱུར་བ་དང་། བག་ཚ་བ་མེད་པར་འཁོར་གྱི་ནང་དུ་འགྲོ་བ་དང་། འཁོར་འདུན་པར་འགྱུར་བ་དང་། ལྷ་དང་མི་རྣམས་དགའ་བར་འགྱུར་བ་དང་། ལོངས་སྤྱོད་ཆེ་བར་འགྱུར་བ་དང་། མཐོ་རིས་སུ་སྐྱེ་བར་འགྱུར་བ་དང་། མྱུར་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་སྟེ།
en: One will have a long life; one will have a beautiful appearance; one will be powerful; one will possess good memory and will be quick witted; one will move intrepidly in an assembly; one will easily sway the assembly in one’s favor; one will be dear to gods and humans; one will have great prosperity; one will be reborn in heaven; and one will quickly attain complete nirvāṇa.

source: བཅུ་པོ་དེ་དག་ནི་ཁ་ཟས་བྱིན་པའི་ཕན་ཡོན་ནོ།
en: These are the ten blessings of offering food. “
